{
  "add_bos_token": false,
  "add_eos_token": false,
  "bos_token": "<|startoftext|>",
  "chat_template": "{% for message in messages %}{% set role = message['role'] | lower %}{% if role == 'user' %}{% set role = 'HUMAN' %}{% endif %}{% set role = role | upper %}{{ '<role>' + role + '</role>' + message['content'] }}{% endfor %}{% if add_generation_prompt %}{{ '<role>ASSISTANT</role>' }}{% endif %}",
  "clean_up_tokenization_spaces": false,
  "cls_token": "[CLS]",
  "eos_token": "<|endoftext|>",
  "fast_tokenizer": true,
  "gmask_token": "[gMASK]",
  "merges_file": null,
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "<|endoftext|>",
  "tokenizer_class": "PreTrainedTokenizerFast",
  "trust_remote_code": true,
  "vocab_file": null
}
